In [1]:
import pandas as pd

In [2]:
students = pd.read_csv('students.csv')
students

      Name Major  Level   GPA
0     Reem    CS      5  4.40
1     Nada    IT      9  4.80
2     Sara    IS      3  3.45
3     Majd    IT      4  4.71
4  Alanoud    CS      9  4.88
5     Amal    IT      4  4.99

In [4]:
students['Name']#[column]

0       Reem
1       Nada
2       Sara
3       Majd
4    Alanoud
5       Amal
Name: Name, dtype: object

In [5]:
students[['Name','Major']]#[column,column,or more]

      Name Major
0     Reem    CS
1     Nada    IT
2     Sara    IS
3     Majd    IT
4  Alanoud    CS
5     Amal    IT

In [7]:
students[2:5]#[start:end]

      Name Major  Level   GPA
2     Sara    IS      3  3.45
3     Majd    IT      4  4.71
4  Alanoud    CS      9  4.88

In [9]:
# the loc[] function
students.loc[2:4,['Name','Major']]#[start:end, [column,column,...]]

      Name Major
2     Sara    IS
3     Majd    IT
4  Alanoud    CS

In [10]:
#the sample() Function returns a Random data
students.sample()

   Name Major  Level   GPA
3  Majd    IT      4  4.71

In [11]:
students.sample()

   Name Major  Level  GPA
0  Reem    CS      5  4.4

In [12]:
students.sample(3)#number of data

   Name Major  Level   GPA
1  Nada    IT      9  4.80
0  Reem    CS      5  4.40
5  Amal    IT      4  4.99

In [13]:
students.sample(3, random_state=23)

      Name Major  Level   GPA
5     Amal    IT      4  4.99
4  Alanoud    CS      9  4.88
2     Sara    IS      3  3.45

In [14]:
students.sample(3, random_state=23)#the same data

      Name Major  Level   GPA
5     Amal    IT      4  4.99
4  Alanoud    CS      9  4.88
2     Sara    IS      3  3.45

In [16]:
#conditions
coundition = students['GPA'] > 4
coundition

0     True
1     True
2    False
3     True
4     True
5     True
Name: GPA, dtype: bool

In [17]:
students[coundition]

      Name Major  Level   GPA
0     Reem    CS      5  4.40
1     Nada    IT      9  4.80
3     Majd    IT      4  4.71
4  Alanoud    CS      9  4.88
5     Amal    IT      4  4.99

In [18]:
coundition = students['GPA'] > 4.7
students[coundition]

      Name Major  Level   GPA
1     Nada    IT      9  4.80
3     Majd    IT      4  4.71
4  Alanoud    CS      9  4.88
5     Amal    IT      4  4.99

In [19]:
#null values
students.isnull()

    Name  Major  Level    GPA
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False